[Killed] Binary expression mutation
src/RemoveClass.cs:20:17
     {
         public static void Remove(IList<Value> container, Value data)
         {
-            if (data == null) return;
+            if (data != null) return;
 
             if (container.All(c => c.SomeField != data.SomeField)) return;

[Killed] Linq method mutation (All() to Any())
src/RemoveClass.cs:22:17
         {
             if (data == null) return;
 
-            if (container.All(c => c.SomeField != data.SomeField)) return;
+            if (container.Any(c => c.SomeField != data.SomeField)) return;
 
             container.Remove(data);

[Survived] Binary expression mutation
src/RemoveClass.cs:22:36
         {
             if (data == null) return;
 
-            if (container.All(c => c.SomeField != data.SomeField)) return;
+            if (container.All(c => c.SomeField == data.SomeField)) return;
 
             container.Remove(data);

[Killed] Binary expression mutation
src/RemoveClass.cs:31:57
         {
             if (data == null) return;
 
-            var deleteT = container.FirstOrDefault(c => c.SomeField == data.SomeField);
+            var deleteT = container.FirstOrDefault(c => c.SomeField != data.SomeField);
             if (deleteT == null) return;
 

[Killed] Linq method mutation (FirstOrDefault() to First())
src/RemoveClass.cs:31:27
         {
             if (data == null) return;
 
-            var deleteT = container.FirstOrDefault(c => c.SomeField == data.SomeField);
+            var deleteT = container.First(c => c.SomeField == data.SomeField);
             if (deleteT == null) return;
 

[Killed] Binary expression mutation
src/RemoveClass.cs:32:17
             if (data == null) return;
 
             var deleteT = container.FirstOrDefault(c => c.SomeField == data.SomeField);
-            if (deleteT == null) return;
+            if (deleteT != null) return;
 
             container.Remove(deleteT);

[Killed] Binary expression mutation
src/RemoveClass.cs:41:58
         {
             if (data == null) return;
 
-            var deleteT = container.SingleOrDefault(c => c.SomeField == data.SomeField);
+            var deleteT = container.SingleOrDefault(c => c.SomeField != data.SomeField);
 
             if (deleteT == null) return;

[Killed] Linq method mutation (SingleOrDefault() to Single())
src/RemoveClass.cs:41:27
         {
             if (data == null) return;
 
-            var deleteT = container.SingleOrDefault(c => c.SomeField == data.SomeField);
+            var deleteT = container.Single(c => c.SomeField == data.SomeField);
 
             if (deleteT == null) return;

[Killed] Binary expression mutation
src/RemoveClass.cs:43:17
 
             var deleteT = container.SingleOrDefault(c => c.SomeField == data.SomeField);
 
-            if (deleteT == null) return;
+            if (deleteT != null) return;
 
             container.Remove(deleteT);
