[Survived] Binary expression mutation
src/SampleClass.cs:9:17
     {
         public static bool Method(bool a, bool b)
         {
-            if (a && b) // mutate to ||
+            if (a || b) // mutate to ||
                 return true;
             else

[NoCoverage] Boolean mutation
src/SampleClass.cs:10:24
         public static bool Method(bool a, bool b)
         {
             if (a && b) // mutate to ||
-                return true;
+                return false;
             else
                 return false;

[Killed] Binary expression mutation
src/SampleClass.cs:17:17
 
         private static bool ExceptionMethod(int a)
         {
-            if (a < 0)
+            if (a <= 0)
                 throw new ArgumentException("USER_DB is not path pattern user_adminXXXX", nameof(a));
 

[Killed] Binary expression mutation
src/SampleClass.cs:17:17
 
         private static bool ExceptionMethod(int a)
         {
-            if (a < 0)
+            if (a > 0)
                 throw new ArgumentException("USER_DB is not path pattern user_adminXXXX", nameof(a));
 

[Killed] String mutation
src/SampleClass.cs:28:28
             try
             {
                 if (ExceptionMethod(a))
-                    return "Successfully";
+                    return "";
             }
             catch (ArgumentException e)

[Killed] Binary expression mutation
src/SampleClass.cs:41:20
         public static int ForMethod()
         {
             var index = 0;
-            while (index < 11)
+            while (index > 11)
             {
                 index++;

[Survived] Binary expression mutation
src/SampleClass.cs:41:20
         public static int ForMethod()
         {
             var index = 0;
-            while (index < 11)
+            while (index <= 11)
             {
                 index++;

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
src/SampleClass.cs:43:17
             var index = 0;
             while (index < 11)
             {
-                index++;
+                                index--;
                 if (index == 10) // mutate to >=10  !=10    <10
                 {

[Killed] Binary expression mutation
src/SampleClass.cs:44:21
             while (index < 11)
             {
                 index++;
-                if (index == 10) // mutate to >=10  !=10    <10
+                if (index != 10) // mutate to >=10  !=10    <10
                 {
                     break;

[Killed] Binary expression mutation
src/SampleClass.cs:55:17
 
         public static int Limit(int limit)
         {
-            if (limit > 99) limit = 100;
+            if (limit < 99) limit = 100;
 
             return limit;

[Killed] Binary expression mutation
src/SampleClass.cs:55:17
 
         public static int Limit(int limit)
         {
-            if (limit > 99) limit = 100;
+            if (limit >= 99) limit = 100;
 
             return limit;
